{"keras_version": "2.1.2", "backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "bias_regularizer": null, "units": 300, "activation": "relu", "dtype": "float32", "kernel_regularizer": null, "trainable": true, "batch_input_shape": [null, 784], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "use_bias": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "units": 150, "activation": "relu", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "units": 50, "activation": "relu", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "units": 10, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}