{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "batch_input_shape": [null, 784], "activation": "relu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "units": 800, "kernel_regularizer": null, "dtype": "float32", "name": "dense_1", "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 800, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 10, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null}}], "keras_version": "2.1.2"}