{"backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "batch_input_shape": [null, 784], "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "activation": "relu", "units": 300, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "relu", "units": 150, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_3", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "relu", "units": 50, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_4", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "softmax", "units": 10, "bias_regularizer": null, "bias_constraint": null}}], "keras_version": "2.1.2", "class_name": "Sequential"}